app/views/iresources/index.html.haml

      Тип:
      - Iresource.select("level, count(id) as count").group(:level).order(:level).each do |iresource|
---
SELECT COUNT(*) FROM "iresources"
SELECT level, count(id) as count FROM "iresources" GROUP BY level ORDER BY "iresources"."level" ASC

      Категория ресурса:
      - Iresource.select("risk_category, count(id) as count").group(:risk_category).order(:risk_category).each do |iresource|
---
SELECT risk_category, count(id) as count FROM "iresources" GROUP BY risk_category ORDER BY "iresources"."risk_category" ASC