app/views/directives/index.html.haml

SELECT COUNT(*) FROM "directives"
---
      Статус:
      - Directive.select("status, count(id) as count").group(:status).order(:status).each do |d|

SELECT title, count(id) as count FROM "directives" GROUP BY title ORDER BY "directives"."title" ASC
---
    Тип директивы:
    - Directive.select("title, count(id) as count").group(:title).order(:title).each do |directive|

SELECT body, count(id) as count FROM "directives" GROUP BY body ORDER BY "directives"."body" ASC
---
    Принявший орган:
    - Directive.select("body, count(id) as count").group(:body).order(:body).each do |directive|