app/views/directives/show.html.haml

%p
- if @directive.document_directive.count > 0
---
SELECT "documents".* FROM "documents" INNER JOIN "document_directives" ON "documents"."id" = "document_directives"."document_id" WHERE "document_directives"."directive_id" = $1  [["directive_id", 32]]
SELECT COUNT(*) FROM "document_directives" WHERE "document_directives"."directive_id" = $1  [["directive_id", 32]]