app/views/bapps/index.html.haml

SELECT COUNT(*) FROM "bapps"
SELECT apptype, count(id) as count FROM "bapps" GROUP BY apptype ORDER BY "bapps"."apptype" ASC
---
        Тип:
        - Bapp.select("apptype, count(id) as count").group(:apptype).order(:apptype).each do |bapp|

SELECT bapps.id FROM "bapps"
---
        Теги:
        = raw Bapp.all_tags.map { |t| link_to t.name, tag_bapps_path(t.name), class: 'tags' }.join('&nbsp; ')