app/views/business_roles/index.html.haml


          -if ro.users.count > 0
---
SELECT COUNT(*) FROM "users" INNER JOIN "user_business_roles" ON "users"."id" = "user_business_roles"."user_id" WHERE "user_business_roles"."business_role_id" = $1  [["business_role_id", 192]]