app/views/business_roles/show.html.haml

SELECT "user_business_roles".* FROM "user_business_roles" WHERE "user_business_roles"."business_role_id" = $1  [["business_role_id", 87]]
---
    %th Процесс
  - @business_role.user_business_role.each do |business_role|

SELECT "bproces".* FROM "bproces" WHERE "bproces"."id" = $1 ORDER BY "bproces"."id" ASC LIMIT 1  [["id", 215]]
SELECT "business_roles".* FROM "business_roles" WHERE "business_roles"."id" = $1 ORDER BY "business_roles"."id" ASC LIMIT 1  [["id", 87]]
---
      %td= business_role.note
      %td= link_to Bproce.find(business_role.business_role.bproce).shortname, bproce_path(business_role.business_role.bproce)