app/views/users/_user_busines_roles.html.haml

SELECT "bproces".* FROM "bproces" WHERE "bproces"."id" = $1 ORDER BY "bproces"."id" ASC LIMIT 1  [["id", 3]]
SELECT "business_roles".* FROM "business_roles" WHERE "business_roles"."id" = $1 ORDER BY "business_roles"."id" ASC LIMIT 1  [["id", 61]]
---
        %td= link_to business_role.business_role.name, business_role_path(business_role.business_role)
        %td= link_to Bproce.find(business_role.business_role.bproce).name, bproce_path(business_role.business_role.bproce)