app/views/users/index.html.haml

SELECT "roles".* FROM "roles" INNER JOIN "user_roles" ON "roles"."id" = "user_roles"."role_id" WHERE "user_roles"."user_id" = $1  [["user_id", 97]]
---
              = link_to image_tag('page_edit.gif', :alt => 'Изменить'), edit_user_path(user), class: 'button-img'
              -user.roles.each do |role|

SELECT office, count(id) as count FROM "users" GROUP BY office ORDER BY "users"."office" ASC
---
Каб.:
- User.select("office, count(id) as count").group(:office).order(:office).each do |user|

SELECT COUNT(*) FROM "roles" INNER JOIN "user_roles" ON "roles"."id" = "user_roles"."role_id" WHERE "user_roles"."user_id" = $1  [["user_id", 97]]
---
  - UserRole.select("role, count(id) as count").group(:role).order(:role).each do |user|
    -if user.role.to_s.empty?