app/views/users/show.html.haml

      = @usr.phone
      -if @usr.roles.count
        %b роли доступа:
        - @usr.roles.each do |role|
---
SELECT COUNT(*) FROM "roles" INNER JOIN "user_roles" ON "roles"."id" = "user_roles"."role_id" WHERE "user_roles"."user_id" = $1  [["user_id", 97]]
SELECT "roles".* FROM "roles" INNER JOIN "user_roles" ON "roles"."id" = "user_roles"."role_id" WHERE "user_roles"."user_id" = $1  [["user_id", 97]]