app/views/home/index.html.haml

        %td= link_to Bproce.find(business_role.business_role.bproce).shortname, bproce_path(business_role.business_role.bproce)
  - if current_user.bproce.count > 0
---
SELECT COUNT(*) FROM "bproces" WHERE "bproces"."user_id" = $1  [["user_id", 97]]

    = link_to "Роли:", business_roles_path
    = BusinessRole.count
---
SELECT COUNT(*) FROM "business_roles"

    = link_to "Рабочие места:", workplaces_path
    = Workplace.count
---
SELECT COUNT(*) FROM "workplaces"

    = link_to "Приложения:", bapps_path
    = Bapp.count
---
SELECT COUNT(*) FROM "bapps"

    = link_to "Документы:", documents_path
    = Document.count
---
SELECT COUNT(*) FROM "documents"

    = link_to "Сотрудники:", users_path
    = User.count
---
SELECT COUNT(*) FROM "users"