app/views/pages/about.html.haml


Процессов #{Bproce.count}
Ролей #{BusinessRole.count}
Рабочих мест #{Workplace.count}
Приложений #{Bapp.count}
Документов #{Document.count}
-if can? :show, User.first
  Пользователей #{User.count}
---
SELECT COUNT(*) FROM "bproces"
SELECT COUNT(*) FROM "business_roles"
SELECT COUNT(*) FROM "workplaces"
SELECT COUNT(*) FROM "bapps"
SELECT COUNT(*) FROM "documents"
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "users"

    %th Краткое описание
  - Role.order(:description).all.each do |r|
---
SELECT "roles".* FROM "roles" ORDER BY "roles"."description" ASC