app/views/documents/index.html.haml

    Статус:
    - Document.select('status, count(id) as count').group(:status).order(:status).each do |d|
---
SELECT COUNT(*) FROM "documents"
SELECT status, count(id) as count FROM "documents" GROUP BY status ORDER BY "documents"."status" ASC

    Уровень:
    - Document.select('dlevel, count(id) as count').group(:dlevel).order(:dlevel).each do |d|
---
SELECT dlevel, count(id) as count FROM "documents" GROUP BY dlevel ORDER BY "documents"."dlevel" ASC

    Оригинал:
    - Document.select('place, count(id) as count').group(:place).order(:place).each do |d|
---
SELECT place, count(id) as count FROM "documents" GROUP BY place ORDER BY "documents"."place" ASC

    Теги:
    = raw Document.all_tags.map { |t| link_to t.name, tag_documents_path(t.name), class: 'tags' }.join('&nbsp; ')
---
SELECT documents.id FROM "documents"