app/views/workplaces/index.html.haml

      Местоположение:
      - Workplace.select("location, count(id) as count").group(:location).order(:location).each do |wp|
---
SELECT COUNT(*) FROM "workplaces"