app/views/workplaces/index.html.haml

SELECT COUNT(*) FROM "users" INNER JOIN "user_workplaces" ON "users"."id" = "user_workplaces"."user_id" WHERE "user_workplaces"."workplace_id" = $1  [["workplace_id", 196]]
---
          = link_to workplace.users.first.displayname, workplace.users.first
          -if workplace.users.count > 1

SELECT "user_workplaces".* FROM "user_workplaces" WHERE "user_workplaces"."workplace_id" IN (196, 171, 170, 154, 186, 112, 136, 201, 113, 114)
SELECT location, count(id) as count FROM "workplaces" GROUP BY location
---
Местоположение:
- Workplace.group(:location).each do |wp|