app/views/workplaces/show.html.haml

SELECT "bproce_workplaces".* FROM "bproce_workplaces" WHERE "bproce_workplaces"."workplace_id" = $1  [["workplace_id", 112]]
SELECT "user_workplaces".* FROM "user_workplaces" WHERE "user_workplaces"."workplace_id" = $1  [["workplace_id", 112]]
SELECT COUNT(*) FROM "bproce_workplaces" WHERE "bproce_workplaces"."workplace_id" = $1  [["workplace_id", 112]]
SELECT COUNT(*) FROM "user_workplaces" WHERE "user_workplaces"."workplace_id" = $1  [["workplace_id", 112]]
---

-if @workplace.bproce_workplaces.count > 0