app/views/bproces/index.html.haml

SELECT bproces.id FROM "bproces"
---
Теги:
= raw Bproce.all_tags.map { |t| link_to t.name, tag_bproces_path(t.name), class: 'tags' }.join('&nbsp; ')