class PopulateDb < ActiveRecord::Migration
  def up
    PublicActivity.enabled = false

  	12.times.map do |i|
      Agent.create!(name: ['ООО "Развитие"', 'ПАО "Газпромбанк"', 'ОАО "Открытые технологии"', 'ИП Иванов Иван Иванович', 'ООО "1С"', 
        'ООО "Вектор Плюс"', 'ИП Петров Петр Петрович', 'ООО "Строитель"', 'ОАО "Коммунальщик-3"', 'ПАО "Сетевая компания"',
        'ООО "Кудесник"', 'АО "Жилищник ХЗ"'][i],
        shortname: ['Развитие', 'Газпромбанк', 'Открытые технологии', 'Иванов И.И.', '1С', 
        'Вектор+', 'Петров П.П.', 'Строитель', 'Коммунальщик-3', 'Сетевая компания',
        'Кудесник', 'Жилищник'][i],
        town: ['Пермь', 'Сочи', 'Москва', 'Екатеринбург', 'Орел'][rand(5)],
        address: ['ул.', 'пл.', 'пр.'][rand(3)] + ['Ленина', 'Ильича', 'Московская', 'Ульянова', 'Коммунизма'][rand(5)] + ", д.#{rand(200)}",
        contacts: "тел. +7 (#{rand(999)}) #{rand(9999)}-#{rand(999)}"
      )
  	end
  end
end
