app/controllers/bapps_controller.rb

SELECT "bapps".* FROM "bapps" ORDER BY name asc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "bapps"
SELECT apptype, count(id) as count FROM "bapps" GROUP BY apptype ORDER BY "bapps"."apptype" ASC
---
  def index
    if params[:bproce_id].present? # это приложения выбранного процесса
      @bp = Bproce.find(params[:bproce_id]) # информация о процессе
      @bproce_bapps = @bp.bproce_bapps.paginate(per_page: 10, page: params[:page])
    elsif params[:all].present?
      @bapps = Bapp.all
    elsif params[:apptype].present?
      @bapps = Bapp.searchtype(params[:apptype]).order(sort_column + ' ' + sort_direction).paginate(per_page: 10, page: params[:page])