app/controllers/bproces_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 97 ORDER BY "users"."id" ASC LIMIT 1
SELECT "bproces".* FROM "bproces" ORDER BY lft ASC
---
  def index
    if params[:all].present?
      @bproces = Bproce.nested_set
    elsif params[:tag].present?
      @bproces = Bproce.nested_set.tagged_with(params[:tag]).search__by_all_column(params[:search])
    elsif params[:user].present? #  список процессов пользователя
      @user = User.find(params[:user])
      @bproces = Bproce.nested_set.where(user_id: params[:user])
    else
      @bproces = if params[:search].present?