app/controllers/business_roles_controller.rb

  def index
    if params[:all].present?
      @business_roles = BusinessRole.order(sort_column + ' ' + sort_direction)
    else
      @business_roles = BusinessRole.search(params[:search]).order(sort_column + ' ' + sort_direction).paginate(:per_page => 10, :page => params[:page])
    end
    @business_roles = @business_roles.find(:all, :include => :users)
---
SELECT "user_business_roles".* FROM "user_business_roles" WHERE "user_business_roles"."business_role_id" IN (192, 106, 51, 101, 69, 85, 80, 18, 86, 81)
SELECT "business_roles".* FROM "business_roles" ORDER BY name asc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "business_roles"
SELECT "roles".* FROM "roles" INNER JOIN "user_roles" ON "roles"."id" = "user_roles"."role_id" WHERE "user_roles"."user_id" = $1  [["user_id", 97]]
SELECT "users".* FROM "users" WHERE "users"."id" = 97 ORDER BY "users"."id" ASC LIMIT 1