app/controllers/directives_controller.rb

  def index
    directives = Directive.search(params[:search])
    directives = directives.where(title: params[:title]) if params[:title].present?
    directives = directives.where(body: params[:body]) if params[:body].present?
    directives = directives.where(status: params[:status]) if params[:status].present?
    @directives = directives.order(sort_order(sort_column, sort_direction)).paginate(per_page: 10, page: params[:page])
---
SELECT COUNT(*) FROM "directives"
SELECT title, count(id) as count FROM "directives" GROUP BY title ORDER BY "directives"."title" ASC

  def set_directive
    if params[:search].present? # это поиск
      directives = Directive.search(params[:search])
      @directives = directives.order(sort_order(sort_column, sort_direction)).paginate(per_page: 10, page: params[:page])
      render :index # покажем список найденного
    else
      @directive = params[:id].present? ? Directive.find(params[:id]) : Directive.new
---
SELECT "directives".* FROM "directives" WHERE "directives"."id" = $1 LIMIT 1  [["id", "32"]]