app/controllers/documents_controller.rb

SELECT "documents".* FROM "documents" ORDER BY name asc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "documents"
SELECT status, count(id) as count FROM "documents" GROUP BY status ORDER BY "documents"."status" ASC
---
  def index
    if params[:directive_id].present? # документы относящиеся к директиве
      @directive = Directive.find(params[:directive_id])
      @documents = @directive.document.paginate(:per_page => 10, :page => params[:page])
    else
      if params[:all].present?
        @documents = Document.order('cast (part as integer)', :name).all
      else
        if params[:place].present?  # список документов по месту хранения
          @documents = Document.where(:place => params[:place]).order(sort_column + ' ' + sort_direction).paginate(:per_page => 10, :page => params[:page])
        else
          if params[:dlevel].present? #  список документов уровня
            @documents = Document.where(:dlevel => params[:dlevel]).order(sort_column + ' ' + sort_direction).paginate(:per_page => 10, :page => params[:page])
          else
            if params[:part].present? #  список документов раздела документооборота
              @documents = Document.where(:part => params[:part]).order(sort_column + ' ' + sort_direction).paginate(:per_page => 10, :page => params[:page])
            else
              if params[:status].present? #  список документов статуса
                ss = params[:status]
                @documents = Document.where(:status => ss).order(sort_column + ' ' + sort_direction).paginate(:per_page => 10, :page => params[:page])
              else
                if params[:place].present? #  список документов, находящихся в одном месте
                  if params[:place].size == 0
                    @documents = Document.where("place = ''").order(sort_column + ' ' + sort_direction).paginate(:per_page => 10, :page => params[:page])
                  else
                    @documents = Document.where(:place => params[:place]).order(sort_column + ' ' + sort_direction).paginate(:per_page => 10, :page => params[:page])
                  end
                else
                  @documents = Document.search(params[:search]).order(sort_column + ' ' + sort_direction).paginate(:per_page => 10, :page => params[:page])