app/controllers/documents_controller.rb

          @documents = @documents.where(part: params[:part])
          @title_doc += " раздела [#{params[:part]}]"
        elsif params[:user].present? #  список документов пользователя
          @user = User.find(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 97 ORDER BY "users"."id" ASC LIMIT 1