app/controllers/iresources_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 97 ORDER BY "users"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "iresources"
SELECT risk_category, count(id) as count FROM "iresources" GROUP BY risk_category ORDER BY "iresources"."risk_category" ASC
---
  def index
    if params[:all].present?
      @iresources = Iresource.all
    elsif params[:level].present?
      @iresources = Iresource.where(level: params[:level]).order(sort_column + ' ' + sort_direction).paginate(per_page: 10, page: params[:page])
    elsif params[:risk].present?
      @iresources = Iresource.where(risk_category: params[:risk]).order(sort_column + ' ' + sort_direction).paginate(per_page: 10, page: params[:page])
    elsif params[:user].present? #  список ресурсов пользователя
      @user = User.find(params[:user])
      @iresources = Iresource.where(user_id: params[:user]).order(sort_column + ' ' + sort_direction).paginate(per_page: 10, page: params[:page])
    else
      @iresources = Iresource.search(params[:search]).order(sort_column + ' ' + sort_direction).paginate(per_page: 10, page: params[:page])