app/controllers/terms_controller.rb

  def index
    if params[:all].present?
      @terms = Term.all
    else
      if params[:apptype].present?
        @terms = Term.searchtype(params[:apptype]).order(sort_column + ' ' + sort_direction).paginate(per_page: 10, page: params[:page])
---
SELECT "terms".* FROM "terms" ORDER BY name asc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "terms"