app/controllers/users_controller.rb

  def index
    if params[:role].present?
      @role = Role.find_by(name: params[:role])
      users = @role.users.active.search(params[:search])
    elsif params[:office].present?
      users = User.active.where(office: params[:office])
    elsif params[:all].present?
      users = User.active
    else
      users = if params[:search].present?
                User.search(params[:search])
              else
                User.all
              end
      # @users, @alphaParams = User.all.alpha_paginate(params[:letter]){|user| user.lastname}
    end
    @users = users.page(params[:page]).order(sort_order(sort_column, sort_direction))
---
SELECT "users".* FROM "users" WHERE "users"."active" = 't' ORDER BY displayname asc LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "users" WHERE "users"."active" = 't'
SELECT office, count(id) as count FROM "users" GROUP BY office ORDER BY "users"."office" ASC

  def find_user
    if params[:search].present? # это поиск
      @users = User.search(params[:search])
                   .order(sort_order(sort_column, sort_direction))
                   .paginate(per_page: 10, page: params[:page])
      render :index # покажем список найденного
    else
      @usr = params[:id].present? ? User.find(params[:id]) : User.new
---
SELECT "users".* FROM "users" WHERE "users"."id" = 97 ORDER BY "users"."id" ASC LIMIT 1