app/controllers/users_controller.rb

  def show
    @uroles = @usr.user_business_role   # исполняет роли
    @uworkplaces = @usr.user_workplace 	# рабочие места пользователя
    @documents = Document.order(:name).find_all_by_owner_id(@usr)
---
SELECT "documents".* FROM "documents" WHERE "documents"."owner_id" = 97 ORDER BY "documents"."name" ASC