app/controllers/workplaces_controller.rb

SELECT "user_workplaces".* FROM "user_workplaces" WHERE "user_workplaces"."workplace_id" IN (196, 171, 170, 154, 186, 112, 136, 201, 113, 114)
SELECT "users".* FROM "users" WHERE "users"."id" IN (66, 86, 79, 34, 33, 75, 40, 114, 68, 99)
SELECT location, count(id) as count FROM "workplaces" GROUP BY location
SELECT "workplaces".* FROM "workplaces" ORDER BY designation asc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "users" INNER JOIN "user_workplaces" ON "users"."id" = "user_workplaces"."user_id" WHERE "user_workplaces"."workplace_id" = $1  [["workplace_id", 196]]
SELECT COUNT(*) FROM "workplaces"
---
  def index
    if params[:all].present?
      @workplaces = Workplace.includes(:users)
    else
      @workplaces = if params[:location].present?
                      Workplace.where(location: params[:location])
                    else
                      @workplaces = if params[:switch].present?
                                      Workplace.where(switch: params[:switch])
                                    else
                                      Workplace.search(params[:search])
                                    end
                    end
      @workplaces = @workplaces.includes(:users).order(sort_column + ' ' + sort_direction).paginate(per_page: 10, page: params[:page])