app/controllers/workplaces_controller.rb

  def show
    respond_with(@workplace = Workplace.find(params[:id]))
---
SELECT "user_workplaces".* FROM "user_workplaces" WHERE "user_workplaces"."workplace_id" = $1  [["workplace_id", 112]]
SELECT "workplaces".* FROM "workplaces" WHERE "workplaces"."id" = 112 LIMIT 1